# Pandas

**Series in Pandas**

In [1]:
import numpy as np 
import pandas as pd

using list

In [2]:
new_list = [10,20,30,40]

pd.Series(data = new_list)

0    10
1    20
2    30
3    40
dtype: int64

providing custom indexes to our series

In [3]:
labels = ['a','b','c','d']

pd.Series(data = new_list , index= labels)

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
#above code can be also written as 
pd.Series(new_list , labels)

a    10
b    20
c    30
d    40
dtype: int64

**Numpy Array**

In [5]:
arr = np.array([10,30,50,70])

In [6]:
pd.Series(arr)

0    10
1    30
2    50
3    70
dtype: int32

**Using dictonary**

In [7]:
d = {'x':20 , 'y':40 ,'z':60}
pd.Series(d)

x    20
y    40
z    60
dtype: int64

**Series in pandas can hold multiple objects**

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
3    d
dtype: object

In [9]:
pd.Series([sum,print,max])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function max>
dtype: object

**Data Frame**

In [10]:
from numpy.random import randn
np.random.seed(101)

In [11]:
df = pd.DataFrame(randn(4,4), index = 'A B C D '.split() , columns = 'W X Y Z'.split())

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**Indexing**

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [14]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057

**creating new column**

In [15]:
df['new'] = df['W'] + df['Z']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

**removing column**

In [16]:
df.drop('W' , axis = 1)

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.210676
B -0.319318 -0.848077  0.605965  1.257083
C  0.740122  0.528813 -0.589001 -2.607169
D -0.758872 -0.933237  0.955057  1.143752

**if we want to remove permanent any column then we have to inplace = True**

In [17]:
df.drop('new',axis = 1 , inplace = True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**To drop rows we have to specify axis = 0**

In [18]:
df.drop('C' , axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**Selecting Rows**

In [20]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [21]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [22]:
df.iloc[0,0]

2.706849839399938

In [23]:
df.loc['A','W']

2.706849839399938

In [24]:
df.loc[['A','D'],['X','Z']]

          X         Z
A  0.628133  0.503826
D -0.758872  0.955057

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**Boolean or Conditional Selection**

In [26]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [27]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [28]:
df[df['X'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [29]:
df[(df['W']>1) & (df['Z']> 0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

**Playing with index**

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
new_index = 'AAA BBB CCC DDD'.split()

In [33]:
df['index'] = new_index

In [34]:
df

          W         X         Y         Z index
A  2.706850  0.628133  0.907969  0.503826   AAA
B  0.651118 -0.319318 -0.848077  0.605965   BBB
C -2.018168  0.740122  0.528813 -0.589001   CCC
D  0.188695 -0.758872 -0.933237  0.955057   DDD

In [35]:
df.set_index('index')

              W         X         Y         Z
index
AAA    2.706850  0.628133  0.907969  0.503826
BBB    0.651118 -0.319318 -0.848077  0.605965
CCC   -2.018168  0.740122  0.528813 -0.589001
DDD    0.188695 -0.758872 -0.933237  0.955057

**MultiIndex and Index Hierarchy**

In [36]:
outside = ['I1','I1','I1','I2','I2','I2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [37]:
hier_index

MultiIndex([('I1', 1),
            ('I1', 2),
            ('I1', 3),
            ('I2', 1),
            ('I2', 2),
            ('I2', 3)],
           )

In [38]:
data = pd.DataFrame(np.random.randn(6,2),index = hier_index , columns =['A','B'])

In [39]:
data

             A         B
I1 1  0.190794  1.978757
   2  2.605967  0.683509
   3  0.302665  1.693723
I2 1 -1.706086 -1.159119
   2 -0.134841  0.390528
   3  0.166905  0.184502

In [40]:
data.loc['I1'].loc[1]

A    0.190794
B    1.978757
Name: 1, dtype: float64

In [41]:
data.index.names = ['Index' , 'num']

In [42]:
data

                  A         B
Index num
I1    1    0.190794  1.978757
      2    2.605967  0.683509
      3    0.302665  1.693723
I2    1   -1.706086 -1.159119
      2   -0.134841  0.390528
      3    0.166905  0.184502

**Dealing with missing Data**

In [43]:
df1 = pd.DataFrame({'A':[10,np.nan,30],
                    'B':[1,2,np.nan],
                    'C':[100,400,50]})

In [44]:
df1

      A    B    C
0  10.0  1.0  100
1   NaN  2.0  400
2  30.0  NaN   50

In [45]:
df1.dropna()

      A    B    C
0  10.0  1.0  100

In [46]:
df1.fillna(value = 'fixed')

       A      B    C
0   10.0    1.0  100
1  fixed    2.0  400
2   30.0  fixed   50

**Group BY**

In [47]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [48]:
df = pd.DataFrame(data)

In [49]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [50]:
grp_comp = df.groupby('Company')

In [51]:
grp_comp

In [52]:
grp_comp.mean(numeric_only= True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [53]:
grp_comp.std(numeric_only=True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [54]:
grp_comp.max(numeric_only= True)

         Sales
Company
FB         350
GOOG       200
MSFT       340

In [55]:
grp_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [56]:
grp_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging , Joining and Concatenation

In [57]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [58]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [59]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [60]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

**Concatenation**

In [61]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [62]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

**Merging**

In [63]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [64]:
pd.merge(left,right, how = 'inner' , on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [65]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [66]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [67]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [68]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [69]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [70]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [71]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

**Joining**

In [72]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [73]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [74]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Pandas Operations

In [75]:
df = pd.DataFrame({'X':[1,2,3,4],'Y':[222,333,999,222],'Z':['abc','def','ghi','xyz']})
df.head()

   X    Y    Z
0  1  222  abc
1  2  333  def
2  3  999  ghi
3  4  222  xyz

In [76]:
df['Y'].unique()

array([222, 333, 999], dtype=int64)

In [77]:
df['Y'].nunique()

3

In [78]:
df['Y'].value_counts()

Y
222    2
333    1
999    1
Name: count, dtype: int64

**using custom fuction**

In [79]:
def cube(x):
    return x**3

In [80]:
df['X'].apply(cube)

0     1
1     8
2    27
3    64
Name: X, dtype: int64

In [81]:
df['X'].sum()

10

To remove any column permanently

In [82]:
del df['X']

In [83]:
df

     Y    Z
0  222  abc
1  333  def
2  999  ghi
3  222  xyz

In [84]:
df.columns

Index(['Y', 'Z'], dtype='object')

In [85]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [86]:
df.sort_values(by = 'Y')

     Y    Z
0  222  abc
3  222  xyz
1  333  def
2  999  ghi

In [87]:
df.isnull() #if null value is there it will return true

       Y      Z
0  False  False
1  False  False
2  False  False
3  False  False

In [88]:
df.dropna() # remove rows with null values

     Y    Z
0  222  abc
1  333  def
2  999  ghi
3  222  xyz

# Data input and output

**For csv**

To read csv file (pd.read_csv(file_path))

To convert dataframe into csv (df.to_csv(file_name))

**For excel**

To read excel file (pd.read_excel(file_path or file name ,  sheet_name ))

To convert into excel (df.to_excel(file_name))

# This all you need to know about Pandas for data science

.[Pandas](https://pandas.pydata.org/). Please click on text pandas and dive into it to learn more